tutorials/pM4F-Benchmarks/case10/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
mu 		mu [1 -1 -1 0 0 0 0] 1e-3;
rho		rho [1 -3 0 0 0 0 0] 1000;
nu              nu [0 2 -1 0 0 0 0] 1e-6;

// ************************************************************************* //

geochemicalProperties
{
 geochemicalModel phreeqcRM;
 rhol             rhol [1 -3 0 0 0 0 0] 1000;
 mineral (Calcitefake);

 absolutePermeabilityModel KozenyCarman ; //heterogeneousScalarConstant; 
 KozenyCarmanCoeffs //heterogeneousScalarConstantCoeffs
 {
        K0 K0 [0 2 0 0 0 0 0] 1.e-11;
updateFromInitialPoroPerm true;
 }

 dispersionModel archiesLaw; //linearDispersion;
 archiesLawCoeffs //linearDispersionCoeffs
 {
        Di              Di  [0 2 -1 0 0 0 0] 1e-9;
        alphaL          alphaL [0 1 0 0 0 0 0] 0; //1e-9;
	n 2;
 }


 CalcitefakeProperties
 {
        activatePhaseEquilibrium false;
        rhos rhos [1 -3 0 0 0 0 0] 2707;
        Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
        surfaceAreaModel volumeOfSolid; //mingliangLaw; //constantSurfaceArea;
	mingliangLawCoeffs //constantSurfaceAreaCoeffs
	{
	 A0 A0 [0 -1 0 0 0 0 0] 1000000;
	 initVF 0.5;
	 n 1; 
	}
 }

 phreeqcRM
 {
        PhreeqcInputFile "phreeqcInput"; 
        PhreeqcDataBase  "phreeqc.dat";
        use_SNIA false;
        activateUpdatePorosity true;
        StrangSteps 6;
	use_cvODE true;
        cvODETol 1e-5;
	numThreads 8;
 }
}
